여러개의 DataFrame 합치기

concatenating (연결) <br>
merging (병합) join

----

DataFrame merging 방법

In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame({"key":list("bbacaab"),
                    "data1": range(7)})
df2 = pd.DataFrame({"key":list("abd"),
                   "data2": range(3)})

In [3]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [4]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [7]:
pd.merge(df1,df2, on ="key") 
# key 열을 기준으로 하여 merging 을 함
# inner join 이라고 생각하면 됨

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [10]:
pd.merge(df1,df2,on="key", how="outer")
# on 은 어떤 기준으로 merge를 할 것인가?
# how="outer"는 두개의 프레임중의 모든 값이 나옴

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [12]:
pd.merge(df1,df2,on="key",how="left")
#기준이 되는 df1의 값만 모든 값이 나옴

  key  data1  data2
0   b      0    1.0
1   b      1    1.0
2   a      2    0.0
3   c      3    NaN
4   a      4    0.0
5   a      5    0.0
6   b      6    1.0

In [14]:
pd.merge(df1,df2,on="key",how="right")
# df2 의 값만 모든 값들이 나온다

  key  data1  data2
0   b    0.0      1
1   b    1.0      1
2   b    6.0      1
3   a    2.0      0
4   a    4.0      0
5   a    5.0      0
6   d    NaN      2

----

In [22]:
df1 = pd.DataFrame({"key":list("bbacaab"),
                    "data1": range(7)})
df2 = pd.DataFrame({"key":list("ababd"),
                   "data2": range(5)})

In [17]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [18]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [20]:
pd.merge(df1,df2,on="key",how="inner")
# df1의 값과 df2 의 값이 조합되어 나옴

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    b      6      1
5    b      6      3
6    a      2      0
7    a      2      2
8    a      4      0
9    a      4      2
10   a      5      0
11   a      5      2

In [29]:
df3 = pd.DataFrame({"lkey":list("bbacaab"),
                    "data1": range(7)})
df4 = pd.DataFrame({"rkey":list("abd"),
                   "data2": range(3)})
# 키의 이름이 다를 경우

In [27]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [28]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [31]:
pd.merge(df3,df4,left_on="lkey",right_on="rkey")
# 조합으로 만들어 merge를 수행

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

인덱스로 merge

In [33]:
left1=pd.DataFrame({'key':["a","b","a","a","b","c"],"value":range(6)})
right1=pd.DataFrame({"group_val":[3.5,7]}, index=['a','b'])

In [34]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [35]:
right1

   group_val
a        3.5
b        7.0

In [37]:
pd.merge(left1,right1,left_on="key",right_index=True)
# right_index를 하면 index 를 기준으로 하겠다.

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [40]:
pd.merge(right1,left1,right_on="key",left_index=True)
# 반대로 해도 결과값은 똑같음

   group_val key  value
0        3.5   a      0
2        3.5   a      2
3        3.5   a      3
1        7.0   b      1
4        7.0   b      4

In [46]:
# 둘다 인덱스로 할 경우
left2 = pd.DataFrame([[1.,2.],[3.,4.],[5.,6.]],
                    index=['a','c','e'],columns=['Seoul','Incheon'])
right2 = pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[13,14]],
                     index =['b','c','d','e'],columns=['Daegu','Ulsan'])

In [44]:
left2

   Seoul  Incheon
a    1.0      2.0
c    3.0      4.0
e    5.0      6.0

In [45]:
right2

   Daegu  Ulsan
b    7.0    8.0
c    9.0   10.0
d   11.0   12.0
e   13.0   14.0

In [47]:
pd.merge(left2,right2,how="outer",left_index=True,right_index=True)

   Seoul  Incheon  Daegu  Ulsan
a    1.0      2.0    NaN    NaN
b    NaN      NaN    7.0    8.0
c    3.0      4.0    9.0   10.0
d    NaN      NaN   11.0   12.0
e    5.0      6.0   13.0   14.0

----

concatenating (연결)  <br>
행방향 또는 열방향으로 단순히 연결

In [48]:
s1 = pd.Series([0,1],index=["a","b"])
s2 = pd.Series([2,3,4],index=["c","d","e"])
s3 = pd.Series([5,6],index=["f","g"])

In [49]:
s1

a    0
b    1
dtype: int64

In [50]:
s2

c    2
d    3
e    4
dtype: int64

In [51]:
s3

f    5
g    6
dtype: int64

In [53]:
pd.concat([s1,s2,s3]) 
# 리스트 형태로 해주면 단순히 1차원으로 성분이 증가하는 방향으로 생성

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [55]:
pd.concat([s1,s2,s3],axis=1)
# 3개의 serise 가 2차원적으로 연결이 되면서 열방향으로 연결

D:\ana\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [56]:
s4 = pd.concat([s1*5,s3])

In [57]:
s4

a    0
b    5
f    5
g    6
dtype: int64

In [59]:
s1

a    0
b    1
dtype: int64

In [60]:
pd.concat([s1,s4],axis=1)
# s1 과 s4 에도 있는 ab 는 다 값이 나오고 fg는 안나옴

D:\ana\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [63]:
pd.concat([s1,s2,s3],axis=1,keys=["one","two","three"])
# 컬럼의 이름도 정해줄 수 있다.

D:\ana\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

dataframe 으로 concat 하기

In [64]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2),
                  index =['a','b','c'],columns=['one','two'])
df2 = pd.DataFrame(5+np.arange(4).reshape(2,2),
                  index =['a','c'],columns=['three','four'])

In [65]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [66]:
df2

   three  four
a      5     6
c      7     8

In [68]:
pd.concat([df1,df2],axis=1)
# 열방향으로 붙음

D:\ana\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [71]:
df3 = pd.DataFrame(np.random.randn(3,4), columns=['a','b','c','d'])
df4 = pd.DataFrame(np.random.randn(2,3), columns=['b','d','a'])

In [72]:
df3

          a         b         c         d
0 -0.883541  1.113557 -0.279631  1.273273
1 -0.119193 -0.877777  0.875999  1.891754
2 -1.821683 -1.074823  0.382336  0.208840

In [73]:
df4

          b         d         a
0 -0.320397 -0.063834  0.907977
1  0.525890 -0.517736 -1.311526

In [74]:
pd.concat([df3,df4])

D:\ana\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0 -0.883541  1.113557 -0.279631  1.273273
1 -0.119193 -0.877777  0.875999  1.891754
2 -1.821683 -1.074823  0.382336  0.208840
0  0.907977 -0.320397       NaN -0.063834
1 -1.311526  0.525890       NaN -0.517736

In [76]:
pd.concat([df3,df4],ignore_index=True)
# ignore_index 를 하면 인덱스가 순서대로 다시 붙음

D:\ana\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0 -0.883541  1.113557 -0.279631  1.273273
1 -0.119193 -0.877777  0.875999  1.891754
2 -1.821683 -1.074823  0.382336  0.208840
3  0.907977 -0.320397       NaN -0.063834
4 -1.311526  0.525890       NaN -0.517736

---

계층적 인덱스

ex) 서울특별시 강남구 삼성로 212  라고 하면 <br>
큰 서울특별시에서 작게 강남구 >> 계층적으로 작아지는 것을 볼 수 있다.

In [78]:
s= pd.Series(np.random.randn(10),
            index=[["a","a","a","b","b","b","c","c","d","d"],
                  [1,2,3,1,2,3,1,2,2,3]])

In [80]:
s
# 두개의 층을 가지는 인덱스를 만듬

a  1    0.255601
   2   -0.331628
   3   -1.043689
b  1    0.681039
   2    0.953803
   3    0.649883
c  1    0.496305
   2   -1.213754
d  2    0.280060
   3   -1.482670
dtype: float64

In [82]:
s.index
# multiindex 라고 되어 있음을 확인

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [85]:
s["b"]
# b의 하위인덱스의 시리즈를 뽑음

1    0.681039
2    0.953803
3    0.649883
dtype: float64

In [87]:
s["b":"c"]
#  b와 c의 하위 인덱스의 시리즈

b  1    0.681039
   2    0.953803
   3    0.649883
c  1    0.496305
   2   -1.213754
dtype: float64

In [89]:
s[("b",3)]
# b 인덱스의 3인덱스 값

0.6498834375100735

In [91]:
s[:,2]
# 2라는 인덱스의 값들만 나옴

a   -0.331628
b    0.953803
c   -1.213754
d    0.280060
dtype: float64

In [92]:
df= pd.DataFrame(np.arange(12).reshape((4,3)),
                index=[["a","a","b","b"],
                      [1,2,1,2]],
                columns=[["Seoul","Seoul","Busan"],
                        ["Green","Red","Green"]])

In [94]:
df
# 인덱스와 컬럼이 모두 2개의 층을 가지고 있음

    Seoul     Busan
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [97]:
df.index.names=["key1","key2"]
# 인덱스의 이름을 새로 지을 때

In [100]:
df.columns.names = ["city","color"]
# 컬럼의 이름을 새롭게 지을 때도 가능

In [99]:
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [103]:
df["Seoul"] 
# 첫번째의 컬럼이 서울의 하위 데이터프레임을 뽑음

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [105]:
df[("Seoul","Green")]
# 서울이라는 하위층의 그린이라는 하위층의 값을 뽑음

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: (Seoul, Green), dtype: int32

In [107]:
df.loc["a"]

city  Seoul     Busan
color Green Red Green
key2
1         0   1     2
2         3   4     5

In [109]:
df.loc[("a",1)]
# a의 하위 1의 인덱스의 값만 뽑음

city   color
Seoul  Green    0
       Red      1
Busan  Green    2
Name: (a, 1), dtype: int32

In [111]:
df.loc["b",("Seoul","Red")]
# b 인덱스의 seoul , red 컬럼의 값

key2
1     7
2    10
Name: (Seoul, Red), dtype: int32

In [113]:
df.loc[("b",2),"Busan"]
# b 인덱스의 2 인덱스의 busan 컬럼의 값

color
Green    11
Name: (b, 2), dtype: int32

In [116]:
df.loc[("b",1),("Seoul","Green")]
# b 인덱스의 2 인덱스의 서울 ,그린 컬럼의 값

6

----

인덱스 기준 정렬

In [120]:
df.sort_index(axis =0, level=0)
# 행방향 인덱스로 정렬을 하는데 
#level 0은 최상위 인덱스인 key 1 의값을 오름차순으로 하겠다.

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [122]:
df.sort_index(axis=0,level=1)
# 행방향 인덱스 
# level 이 1 이라서 두번째 인덱스인 key2 의 값을 오름차순으로 함

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [125]:
df.sort_index(axis=0,level="key2")
# 1이라고 안하고 이름을 명시해도 위와 동일한 결과값을 얻을 수 있다.

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [127]:
df.sort_index(axis=1,level=0)
# axis =1 이면 열방향 (컬럼)으로 정렬
# level 0 이니 컬럼중에서 최상위인 city로 정렬 abcd 순이라 부산이 먼저

city      Busan Seoul
color     Green Green Red
key1 key2
a    1        2     0   1
     2        5     3   4
b    1        8     6   7
     2       11     9  10

In [129]:
df.sort_index(axis=1,level=1)
# 두번째인 컬러가 오름차순으로 정렬

city      Busan Seoul
color     Green Green Red
key1 key2
a    1        2     0   1
     2        5     3   4
b    1        8     6   7
     2       11     9  10

In [131]:
df.sort_values(by=("Busan","Green"))
# 값을 기준으로 정렬을 했을 경우
# 컬럼이 부산이고 Green 인 값이 오름차순으로 정렬됨 (2,5,8,11)

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [133]:
df.sum(axis=0,level=0)
# 행방향의 합을 구한다.
# level 0 (key1)을 기준으로
# green a 의 sum 값 red a 의 sum 값

city  Seoul     Busan
color Green Red Green
key1
a         3   5     7
b        15  17    19

In [135]:
df.sum(axis=0,level=1)
# key 2가 1인 값들의 합

city  Seoul     Busan
color Green Red Green
key2
1         6   8    10
2        12  14    16

In [136]:
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [139]:
df.mean(axis=1,level="color")
# axis 가 1이라서 열방향으로
# 컬러를 기준으로 평균을 구하게 된다.

color      Green  Red
key1 key2
a    1         1    1
     2         4    4
b    1         7    7
     2        10   10

In [140]:
df2= pd.DataFrame({'a':range(7),'b':range(7,0,-1),
                  'c':['one','one','one','two','two','two','two'],
                  'd':[0,1,2,0,1,2,3]})

In [141]:
df2

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [145]:
df3=df2.set_index(["c","d"])
# c랑 d 의 값이 내려옴

In [144]:
df3

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [147]:
df2.set_index(["c","d"],drop=False) 
# 인덱스로 내리면서 기존의 있는 값을 손실 없게 만듬

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [149]:
df3.reset_index()
# 기존의 계층 인덱스를 값으로 올리고 정수의 인덱스로 대체하는 함수

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

----

데이터 프레임의 모양을 변경

In [150]:
df4 = pd.DataFrame(np.arange(6).reshape((2,3)),
                  index= ['Seoul','Busan'],
                  columns=['one','two','three'])
df4.index.name ="city"
df4.columns.name = "number"

In [151]:
df4

number  one  two  three
city
Seoul     0    1      2
Busan     3    4      5

In [155]:
df5=df4.stack()
# 컬럼이 인덱스의 최하층 인덱스로 붙음

In [154]:
df5

city   number
Seoul  one       0
       two       1
       three     2
Busan  one       3
       two       4
       three     5
dtype: int32

In [157]:
df5.unstack()
# 최하위 인덱스를 컬럼으로 올림

number  one  two  three
city
Seoul     0    1      2
Busan     3    4      5

In [159]:
df5.unstack(level=0)
# 0번 인덱스인 최상위 인덱스를 컬럼으로 올림

city    Seoul  Busan
number
one         0      3
two         1      4
three       2      5

In [161]:
df5.unstack(level="city") 
# 이름으로 해도 똑같음

city    Seoul  Busan
number
one         0      3
two         1      4
three       2      5

In [165]:
s1 = pd.Series([0,1,2,3],index=['a','b','c','d'])
s2 = pd.Series([4,5,6],index=['c','d','e'])
s3 = pd.concat([s1,s2], keys=["one","two"])

In [167]:
s3
# one , two 의 하위층에 c ,d 라는 공통된 것을 볼 수 있다.

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [169]:
s3.unstack() 
# 최하위 인덱스가 컬럼으로 가고
# 겹치는 인덱스가 알아서 처리가 됨

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [170]:
df6 = pd.DataFrame({"left": df5, "right":df5+5},
                  columns=["left","right"])
df6.columns.name = "side"

In [171]:
df6

side          left  right
city  number
Seoul one        0      5
      two        1      6
      three      2      7
Busan one        3      8
      two        4      9
      three      5     10

In [173]:
df6.unstack()
# 최하위에서 최하위로 올라감

side   left           right
number  one two three   one two three
city
Seoul     0   1     2     5   6     7
Busan     3   4     5     8   9    10

In [174]:
df6.unstack(level="city")

side    left       right
city   Seoul Busan Seoul Busan
number
one        0     3     5     8
two        1     4     6     9
three      2     5     7    10

In [175]:
df6.unstack(level="city").stack(level="side")

city          Busan  Seoul
number side
one    left       3      0
       right      8      5
two    left       4      1
       right      9      6
three  left       5      2
       right     10      7

-----

DataFrame 데이터 변형하기

In [177]:
df = pd.DataFrame({'k1':['one']*3 + ['two']*4,
                  'k2':[1,1,2,3,3,4,4]})

In [178]:
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [181]:
df.duplicated()
# 공통된 값이 있으면 TRUE 로 나옴

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [183]:
df.drop_duplicates()
# 중복된 값들이 제거

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [184]:
df["vl"]=np.arange(7)

In [185]:
df

    k1  k2  vl
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [189]:
df.drop_duplicates(["k1"])
# k1 의 값만 보고 중복된 값을 제거 한다.

    k1  k2  vl
0  one   1   0
3  two   3   3

In [191]:
df.drop_duplicates(["k1","k2"], keep="last")
# k1 ,k2 의 값을 제거를 하는데 중복된 값을 제거를 했을 때 
# 제일 마지막의 있는 값을 남김

    k1  k2  vl
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

In [193]:
df.drop_duplicates(["k1","k2"], keep="first")
# 첫번째의 값을 남기고 삭제

    k1  k2  vl
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [2]:
df2 = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami',
                           'corned beef','Bacon','pastrami','honey ham',
                           'nova lox'],
                   'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [3]:
df2

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [4]:
meat_to_animal= {
    'bacon':'pig',
    'pulled pork' : 'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham' : 'pig',
    'nova lox' : 'salmon'
}

In [5]:
df2["animal"] = df2["food"].apply(lambda x: meat_to_animal[x.lower()])

In [6]:
df2

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

이상치 제거

In [7]:
s= pd.Series([1.,-999.,2.,-999.,-1000,3.])

In [8]:
s

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [10]:
s2=s.replace(-999,np.nan)

In [11]:
s2

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [12]:
s2.replace(np.nan,0)

0       1.0
1       0.0
2       2.0
3       0.0
4   -1000.0
5       3.0
dtype: float64

In [13]:
s2.fillna(0)

0       1.0
1       0.0
2       2.0
3       0.0
4   -1000.0
5       3.0
dtype: float64

In [14]:
#카테고리 를 관리하기 위해 
# Categories 함수가 부여 됨

In [15]:
df3 = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a','b','b','a','a','e']})

In [16]:
df3

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [17]:
df3["grade"] = df3["raw_grade"].astype("category")

In [18]:
df3

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [21]:
df3["grade"]
# type 이 카테고리로 된 것을 확인된다

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [22]:
df3["grade"].cat.categories

Index(['a', 'b', 'e'], dtype='object')

In [25]:
df3["grade"].cat.categories = ["very good","good","very bad"]
# 값을 바꿀 수 있다.

In [24]:
df3

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [27]:
df3["grade"]=df3["grade"].cat.set_categories(["very bad","bad","medium","good","very good"])

In [28]:
df3

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [29]:
df3["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [30]:
df3

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [33]:
df3.sort_values(by="grade")
# 정렬을 하게 되면 카테고리 순서대로 정렬이 된다.

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [34]:
age=[20,22,25,27,21,23,37,31,61,45,41,32]
bins = [18,25,35,60,100]

In [36]:
cats = pd.cut(age,bins)

In [37]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [38]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [40]:
cats.codes
# age 의 하나하나의 값이 몇번째 카테고리에 들어가 있는지 확인하는 코드

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [41]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [42]:
group_names = ["Youth","YoungAdult","MiddleAged","Senior"]

In [44]:
pd.cut(age,bins,labels=group_names)
# 카테고리 이름 변경

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [45]:
#bins 없이 할 때
data = np.random.rand(20)

In [46]:
data

array([0.27741147, 0.38708699, 0.91591712, 0.28008776, 0.02208618,
       0.87846519, 0.98052346, 0.79184243, 0.85254881, 0.16924465,
       0.10145521, 0.75004773, 0.64352521, 0.46509598, 0.74422143,
       0.46195267, 0.56705808, 0.7606849 , 0.99467991, 0.13613415])

In [47]:
pd.cut(data,4,precision=2)
#precision 소수점 몇번째 까지 남길 것인지?

[(0.27, 0.51], (0.27, 0.51], (0.75, 0.99], (0.27, 0.51], (0.021, 0.27], ..., (0.27, 0.51], (0.51, 0.75], (0.75, 0.99], (0.75, 0.99], (0.021, 0.27]]
Length: 20
Categories (4, interval[float64]): [(0.021, 0.27] < (0.27, 0.51] < (0.51, 0.75] < (0.75, 0.99]]

In [48]:
data2 = np.random.randn(1000)

In [49]:
data2[:5]

array([-0.16505719,  0.14885507, -0.89414521,  0.80361124, -0.45669822])

In [52]:
cats=pd.qcut(data2,4)
# 4분위수 를 추출해서 구분함

In [51]:
cats

[(-0.655, 0.00974], (0.00974, 0.717], (-4.038, -0.655], (0.717, 2.788], (-0.655, 0.00974], ..., (-4.038, -0.655], (0.717, 2.788], (0.717, 2.788], (0.00974, 0.717], (0.717, 2.788]]
Length: 1000
Categories (4, interval[float64]): [(-4.038, -0.655] < (-0.655, 0.00974] < (0.00974, 0.717] < (0.717, 2.788]]

----

데이터 그룹화

In [53]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                  'key2':['one','two','one','two','one'],
                  'data1': np.random.randn(5),
                  'data2': np.random.randn(5)})

In [54]:
df

  key1 key2     data1     data2
0    a  one -0.855328 -0.427897
1    a  two  0.521720  0.438847
2    b  one -0.245967  1.614592
3    b  two -0.654265  0.466305
4    a  one  1.291328 -0.143041

In [55]:
grouped=df["data1"].groupby(df["key1"])

In [58]:
grouped
# 아직 계산하는 함수를 안 넣어서 그럼

In [57]:
grouped.mean()

key1
a    0.319240
b   -0.450116
Name: data1, dtype: float64

In [59]:
# split - apply - combine
# 나누고 - 함수를 적용하고 - 통합하는

In [63]:
means=df["data1"].groupby([df["key1"],df["key2"]]).mean()
# key1 과 key2 의 값을 둘다 고려해라

In [64]:
means

key1  key2
a     one     0.218000
      two     0.521720
b     one    -0.245967
      two    -0.654265
Name: data1, dtype: float64

In [65]:
means.unstack()

key2       one       two
key1
a     0.218000  0.521720
b    -0.245967 -0.654265

In [66]:
df.groupby("key1").mean()

         data1     data2
key1
a     0.319240 -0.044030
b    -0.450116  1.040449

In [67]:
df.groupby("key1").count()

      key2  data1  data2
key1
a        3      3      3
b        2      2      2

In [68]:
df.groupby(["key1","key2"]).mean()

              data1     data2
key1 key2
a    one   0.218000 -0.285469
     two   0.521720  0.438847
b    one  -0.245967  1.614592
     two  -0.654265  0.466305

In [69]:
df.groupby(["key1","key2"]).count()

           data1  data2
key1 key2
a    one       2      2
     two       1      1
b    one       1      1
     two       1      1

In [71]:
df.groupby(["key1","key2"])["data2"].mean()
# data2 의 값만 평균을 구함

key1  key2
a     one    -0.285469
      two     0.438847
b     one     1.614592
      two     0.466305
Name: data2, dtype: float64

In [73]:
df.groupby("key1")

In [75]:
for name, group in df.groupby("key1"):
    print(name)
    print(" ")
    print(group)

a

  key1 key2     data1     data2
0    a  one -0.855328 -0.427897
1    a  two  0.521720  0.438847
4    a  one  1.291328 -0.143041
b

  key1 key2     data1     data2
2    b  one -0.245967  1.614592
3    b  two -0.654265  0.466305

In [76]:
for (k1,k2), group in df.groupby(["key1","key2"]):
    print(k1,k2)
    print(group)

a one
  key1 key2     data1     data2
0    a  one -0.855328 -0.427897
4    a  one  1.291328 -0.143041
a two
  key1 key2    data1     data2
1    a  two  0.52172  0.438847
b one
  key1 key2     data1     data2
2    b  one -0.245967  1.614592
b two
  key1 key2     data1     data2
3    b  two -0.654265  0.466305

In [77]:
pieces=dict(list(df.groupby("key1")))

In [79]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one -0.855328 -0.427897
 1    a  two  0.521720  0.438847
 4    a  one  1.291328 -0.143041, 'b':   key1 key2     data1     data2
 2    b  one -0.245967  1.614592
 3    b  two -0.654265  0.466305}

In [80]:
pieces["b"]

  key1 key2     data1     data2
2    b  one -0.245967  1.614592
3    b  two -0.654265  0.466305

----